## Plans :thumbsup:

Outputs can be viewed in the Terrateam Console [here](https://app.terrateam.io/i/57819960/runs/4161f900-df41-451e-acdd-2c1f9f503c4e).

## Terrateam Plan Output :thumbsup:
<details>
  <summary>Expand for plan output details</summary>



## Dir: layers/core | Success :thumbsup:
**Dir**: layers/core
**Workspace**: default
**Success**: :thumbsup:
**Command**: `tofu plan -detailed-exitcode -out /tmp/tmp3jsle3b9/plan`

```diff
2024-12-02T20:33:03.891Z [INFO]  OpenTofu version: 1.8.4
2024-12-02T20:33:03.891Z [DEBUG] using github.com/hashicorp/go-tfe v1.36.0
2024-12-02T20:33:03.891Z [DEBUG] using github.com/opentofu/hcl/v2 v2.0.0-20240416130056-03228b26f391
2024-12-02T20:33:03.891Z [DEBUG] using github.com/hashicorp/terraform-svchost v0.1.1
2024-12-02T20:33:03.891Z [DEBUG] using github.com/zclconf/go-cty v1.14.4
2024-12-02T20:33:03.891Z [INFO]  Go runtime version: go1.21.11
2024-12-02T20:33:03.891Z [INFO]  CLI args: []string{"/usr/local/lib/tofuenv/versions/1.8.4/tofu", "show", "/tmp/tmp3jsle3b9/plan"}
2024-12-02T20:33:03.891Z [DEBUG] Attempting to open CLI config file: /github/home/.tofurc
2024-12-02T20:33:03.891Z [DEBUG] File doesn't exist, but doesn't need to. Ignoring.
2024-12-02T20:33:03.891Z [DEBUG] ignoring non-existing provider search directory terraform.d/plugins
2024-12-02T20:33:03.891Z [DEBUG] ignoring non-existing provider search directory /github/home/.terraform.d/plugins
2024-12-02T20:33:03.891Z [DEBUG] ignoring non-existing provider search directory /github/home/.local/share/terraform/plugins
2024-12-02T20:33:03.891Z [DEBUG] ignoring non-existing provider search directory /usr/local/share/terraform/plugins
2024-12-02T20:33:03.891Z [DEBUG] ignoring non-existing provider search directory /usr/share/terraform/plugins
2024-12-02T20:33:03.891Z [DEBUG] Found the config directory: /github/home/.terraform.d
2024-12-02T20:33:03.891Z [INFO]  CLI command args: []string{"show", "/tmp/tmp3jsle3b9/plan"}
2024-12-02T20:33:03.983Z [DEBUG] checking for provisioner in "."
2024-12-02T20:33:03.983Z [DEBUG] checking for provisioner in "/usr/local/lib/tofuenv/versions/1.8.4"
2024-12-02T20:33:03.984Z [DEBUG] created provider logger: level=debug
2024-12-02T20:33:03.984Z [INFO]  provider: configuring client automatic mTLS
2024-12-02T20:33:03.998Z [DEBUG] provider: starting plugin: path=.terraform/providers/registry.opentofu.org/cloudflare/cloudflare/4.47.0/linux_amd64/terraform-provider-cloudflare_v4.47.0 args=[".terraform/providers/registry.opentofu.org/cloudflare/cloudflare/4.47.0/linux_amd64/terraform-provider-cloudflare_v4.47.0"]
2024-12-02T20:33:03.998Z [DEBUG] provider: plugin started: path=.terraform/providers/registry.opentofu.org/cloudflare/cloudflare/4.47.0/linux_amd64/terraform-provider-cloudflare_v4.47.0 pid=338
2024-12-02T20:33:03.998Z [DEBUG] provider: waiting for RPC address: path=.terraform/providers/registry.opentofu.org/cloudflare/cloudflare/4.47.0/linux_amd64/terraform-provider-cloudflare_v4.47.0
2024-12-02T20:33:04.010Z [INFO]  provider.terraform-provider-cloudflare_v4.47.0: configuring server automatic mTLS: timestamp=2024-12-02T20:33:04.009Z
2024-12-02T20:33:04.024Z [DEBUG] provider: using plugin: version=6
2024-12-02T20:33:04.024Z [DEBUG] provider.terraform-provider-cloudflare_v4.47.0: plugin address: address=/tmp/plugin1892034686 network=unix timestamp=2024-12-02T20:33:04.024Z
2024-12-02T20:33:04.058Z [DEBUG] provider.stdio: received EOF, stopping recv loop: err="rpc error: code = Unavailable desc = error reading from server: EOF"
2024-12-02T20:33:04.060Z [DEBUG] provider: plugin process exited: path=.terraform/providers/registry.opentofu.org/cloudflare/cloudflare/4.47.0/linux_amd64/terraform-provider-cloudflare_v4.47.0 pid=338
2024-12-02T20:33:04.060Z [DEBUG] provider: plugin exited
2024-12-02T20:33:04.060Z [DEBUG] created provider logger: level=debug
2024-12-02T20:33:04.060Z [INFO]  provider: configuring client automatic mTLS
2024-12-02T20:33:04.066Z [DEBUG] provider: starting plugin: path=.terraform/providers/registry.opentofu.org/hashicorp/null/3.2.3/linux_amd64/terraform-provider-null args=[".terraform/providers/registry.opentofu.org/hashicorp/null/3.2.3/linux_amd64/terraform-provider-null"]
2024-12-02T20:33:04.067Z [DEBUG] provider: plugin started: path=.terraform/providers/registry.opentofu.org/hashicorp/null/3.2.3/linux_amd64/terraform-provider-null pid=347
2024-12-02T20:33:04.067Z [DEBUG] provider: waiting for RPC address: path=.terraform/providers/registry.opentofu.org/hashicorp/null/3.2.3/linux_amd64/terraform-provider-null
2024-12-02T20:33:04.070Z [INFO]  provider.terraform-provider-null: configuring server automatic mTLS: timestamp=2024-12-02T20:33:04.070Z
2024-12-02T20:33:04.084Z [DEBUG] provider: using plugin: version=5
2024-12-02T20:33:04.084Z [DEBUG] provider.terraform-provider-null: plugin address: address=/tmp/plugin1117015312 network=unix timestamp=2024-12-02T20:33:04.084Z
2024-12-02T20:33:04.095Z [DEBUG] No provider meta schema returned
2024-12-02T20:33:04.096Z [DEBUG] provider.stdio: received EOF, stopping recv loop: err="rpc error: code = Unavailable desc = error reading from server: EOF"
2024-12-02T20:33:04.096Z [DEBUG] provider: plugin process exited: path=.terraform/providers/registry.opentofu.org/hashicorp/null/3.2.3/linux_amd64/terraform-provider-null pid=347
2024-12-02T20:33:04.096Z [DEBUG] provider: plugin exited
2024-12-02T20:33:04.097Z [DEBUG] created provider logger: level=debug
2024-12-02T20:33:04.097Z [INFO]  provider: configuring client automatic mTLS
2024-12-02T20:33:04.102Z [DEBUG] provider: starting plugin: path=.terraform/providers/registry.terraform.io/***/akash/0.1.1/linux_amd64/terraform-provider-akash_v0.1.1 args=[".terraform/providers/registry.terraform.io/***/akash/0.1.1/linux_amd64/terraform-provider-akash_v0.1.1"]
2024-12-02T20:33:04.102Z [DEBUG] provider: plugin started: path=.terraform/providers/registry.terraform.io/***/akash/0.1.1/linux_amd64/terraform-provider-akash_v0.1.1 pid=355
2024-12-02T20:33:04.102Z [DEBUG] provider: waiting for RPC address: path=.terraform/providers/registry.terraform.io/***/akash/0.1.1/linux_amd64/terraform-provider-akash_v0.1.1
2024-12-02T20:33:04.154Z [INFO]  provider.terraform-provider-akash_v0.1.1: configuring server automatic mTLS: timestamp=2024-12-02T20:33:04.154Z
2024-12-02T20:33:04.173Z [DEBUG] provider: using plugin: version=5
2024-12-02T20:33:04.173Z [DEBUG] provider.terraform-provider-akash_v0.1.1: plugin address: address=/tmp/plugin3574882725 network=unix timestamp=2024-12-02T20:33:04.173Z
2024-12-02T20:33:04.192Z [DEBUG] provider.stdio: received EOF, stopping recv loop: err="rpc error: code = Unavailable desc = error reading from server: EOF"
2024-12-02T20:33:04.355Z [DEBUG] provider.terraform-provider-akash_v0.1.1: \x8b     \xff\x94U]lWf\xff\xec\xeb\xf5\xcf\xaf\xed\xf5\xf1\xfao|m7k'\x9e\xf1\x8e\xed\xfc\xb4II\xeb"" U\x84#\xa8*3\x99\xbd^\x8f2;\xb3ܙ\xdd\xc4o\x82\xd2'~H<\xb6"H\x95\x9a\xb9B\x82\xa8
2024-12-02T20:33:04.355Z [DEBUG] provider.terraform-provider-akash_v0.1.1: \x88\xa8\xa0\x96T@ԇ\xa1U\xa9%H\x8b\xee\x9d\xfdK\xec:鋵\xbe\xdfw\xbe\xef\xdcs\xee9s\xe4\x9d[\x97\xbe\xfa\xdf߿\xf3ƣ$\xe1x\x94D z\xec;o\xfdo\xf5\x8b\xf2\xe7\x97*\xe7ދR !\xfc\xf7\xaf~\xa11\x82\x9d\x9a%$1\x8c)m4E\xc2\xf8\x8dKW"4J\xc2\xc0i\x8cD\xe0FH2\xc2Ў\xed
2024-12-02T20:33:04.355Z [DEBUG] provider.terraform-provider-akash_v0.1.1: \x99%$ء\xc4)\x90\x9e\xbbqE\xe8DṰdE\xa1;%\xc5g^\xf9\x83\xc0b\xf0\xbd\x90\xc4bЅ]J7\xc3\xe7\xaf_X|=\x88k\x83\xecQ4E\xda\xf0\xf5w\xaf
2024-12-02T20:33:04.355Z [DEBUG] provider.terraform-provider-akash_v0.1.1: \xffv #>\xa2\xdb\x94\xdeYB$1\xa9$h\x82\xb4\xe3\xf97$\xb7i\xd1}ا$(\x82\xff\xbcuCX\xc4\xe1|\x97\xc4\xe2Џ\xfd\xca M\x90<w\xedL\x8cFI'd%\xd4	)L)\x83H/n\xfe(Fc\xa4.\x99u"*CH'\xfe\xee\x87g\xd6/X7\xa41\xadS ]\xf8\xf2\xa5M\x81\xf5\xc0O\x82|{`G\x94Q\x9a \xddx\xf6¦\xb0K@Y\xda%`\xc7$ԃ\xd7\xcf\xdd\xec\xa6Q\x90\x94\xc08\x8e+
2024-12-02T20:33:04.355Z [DEBUG] provider.terraform-provider-akash_v0.1.1: \x92\xc0W\xbf\xa61\xd2\xb7\xc5^\x98\xc0	\x85&B O\x84h\xac\xad\x9dt\xc4;\xbb\xba{ĵ\xbf\xf2B\xad\xb3\x9b\xa2)ҋ\xd7._\xf5\xac\xf7\xf3\xc3\x84(\x90$\xbeZ\xef\xdd\xf3ay҇\xcf\xfeLv,	\xdf
2024-12-02T20:33:04.355Z [DEBUG] provider.terraform-provider-akash_v0.1.1: \x930\x89\x93\xb2c\xfd\xf8\xfd\x9b\xb2c}\xf0\x9b\xe0\xee}0\x85S\xb2c\xf8\xe2\xfb\xb2\xfd\xd0Ocd \xce\x8c~\x98\xc6iٱx\x92mI\xe1\x99[R'\xef\xac\xec\xc2]ğ\xbep]\xb4l\xfe\xd6&\xab1\xcc(\xe2\xe6\xed\x8b\xc3k]J\xd5k Л\xec\xebHb\xb3C\xf8\x8b\xb7e~\xd9-\x85fpF>\xef4^\xfc\xb9,\xc7\x9c\xa6\xe2y\xff5\xb8\xea\xcc\xe2\xacB(\x90a|\xe5_2\xc5>x]&AF\xf0/\xb7\xff!J\x98\x86Q)\x97\x86ݸ[\xd9C\x81\x8c\xe2׮\xfdG\xe45\x97\x83\x9c\x87a\xe7\x95&\xc8\xbe\xf4\xf6-6\x9f\x91a#\xa0\xa1&\xa1q\xfc\xf1\x8b
2024-12-02T20:33:04.355Z [DEBUG] provider.terraform-provider-akash_v0.1.1: h\xf6Jh\xe6q^\xc9R 
2024-12-02T20:33:04.355Z [DEBUG] provider.terraform-provider-akash_v0.1.1: \xbe\xf1\xeb\x84\xe2l\xb39:\xea\xca%\xf8\xdd3\x8f\xd2\x87;q#
2024-12-02T20:33:04.355Z [DEBUG] provider.terraform-provider-akash_v0.1.1: \xbc\xa7Q2\x88!\x87E\Tf	Q`	\x97\xe4\xaf	؋{\x95}ŋ\x97o\x8b`
2024-12-02T20:33:04.355Z [DEBUG] provider.terraform-provider-akash_v0.1.1: \xdf\xeeLa?\xeeWP \x93\xf8\xea{?\xcfw\xeeט\x84\x87\xf1a\xe5
2024-12-02T20:33:04.355Z [DEBUG] provider.terraform-provider-akash_v0.1.1: d
2024-12-02T20:33:04.358Z [DEBUG] provider.terraform-provider-akash_v0.1.1: _\xfa\xb3Ħ\xe0\x8f6\xf1\xa0Ħ\xf1\xb5\xb7$6]\xbf\xfe4\xc2C\xca#\xc9t\xbdA\xbdC\xe9Htx 52:6\xaeL\xd0ɩ\xe94\x90T*\x950V.\xdf\xec\xce<\xba?\x94\xee'a\xa8\\xfe\xd3\xd97\xab\xe3X\xa9\=\xfbfu<\xf3\xc9t\x9aD\xa0R\xa9ܩV\xab\xd5j+\xcfU\xeeT\xab\xd5j5\x949\xacBo\xf7\x8cB\xd1f\x9e3ݒ\xe3\xeb\xb3X\xd2;\xc3q=f\xbaN\xceӧM\xbeQ\xf4]\x8dٶU\xf4-S\xb3\x9fqǰ\xb55\xcb\xf0\xd5⒞=Z\xb2\xf5=&߁\xa6\x97\xf4\xec\xea\x9ae\xf8{ռ\xabϛ|\xb6\x9a\x99=\xb6\xa4g?e\xb3s\xfc\xf5hɾOR_/|\xa4\xb0cy>3k\xd2\xc7\K?\xe1\x96N\xd8L\xdfu\x9f\xa0\x86\xfa\xbe\xfb\xefV_1\xdb\xe0GK\xb6\xafg\xee	TE=\x96K\xbc\xccj\xac\xc7\x8fI\xe6\xe0=̆7\xd63\xe7\xaag\xe5\x9dO3\x87q\xcb\xd4Z-\xc0\xf3\xae\xde\xdbz,\xf4\xe1֣\x80\xb9긆W\xd8\xca_\xb1\xf2\x8e>\xde\xca\x97\xe3V\xd9\xf0\xd9g\xd9\xc6L@\xadN/\xcdP\x9793|\xb6̸o\xadY\xa6\xe13\xbd\xaf8yWߝ\xb7\xfc\xf5\xd2	\xd5tں\xe1\xad[\xa6ˋZޝ+ڥ\xbc\xe5\xa8y\xe60nB\xfa\xdc\xce\xe4\xc3嬺\xa8.j\xdf\xf6\x84\xf6\xd4\xcetu\x85\xf12ӵ\x9dYuQO\x90\xb9\x90}|\xdb \x9fqn\xac\xb9\xbcP\xcb|.\xefj\xfeZ\x91\xbb\xbe[^\xd2\xfc\xb5\xa5\x9a@`z\xf4A5\x97\xe7\xd5jv;\xa9\x8f\x9f\x92\x97;\xa9\x95u\xadV\xdaFNAJO<XJ\x81\xc6Ხf\xf7\xa9\xf35\xad Q\x9cG\xa5]\xabIG\xc1\xb0U\xfcѕ\x96jr\xb7l\xe5\x9f3N޺&`\xe1\xd3\xc5K\x8eoX\xc0O\xd4\xfeӊ\xdc5<U{k̶-\xb1\xa7\xb6\x8c\x98\xaft\x9d%\xa7\xa8̸\xb5\xb6Q\x9f\xa3\xfakm\xc5\xee9\xfc\x82h\xa9T	[y2ې\x97\xf3`\xae3\xf3\xa4\x98#\xc3/q\xb6eh[\xe9ʗKg;,\xb15\xb1r\xefَ\xb5\xa0\xc9\xda\xcd\xc4$\xf7:b89o\xdd8ɚ9$\x9b$\xcd(\xf9\xebj\xde\xd55\xcf\xd4\xccl\xf0f\x9b\xa1\xbe\xe1\xb3\xe3\x9f[\xc9.̨\x9c\xb9e\xdbb\x8e\xdf:\xe3\xf5\xba\xfb\xb6\xa7\xad\xd7W\x99U\xdf\xf6\xb2\xc2$\xfb\xa0&	\x9d\xde\xb2\xec:Ό\xc86\xb2\xd3ǚ\x9c-\xe6¶\xb5(\x99\x9aF\xc3a\xd9u|vڿ\xab(\xa6\xeb\xc8Ƕ]`ö8\xd2to\xa87H\xfa\xa3y\xd7\xcd\xdbbDl\xc3ɫ.\xcfky^45\x93\xb3s|˰E\x94o{˜弙`$Z\xee\x96\xdd>^n\xa7\xfd\xea|\xab\x8e(\xbe\xb8\xee\xc1\xedC\x9a/\xcd\xe7\x86\xe3]\xee\xabO\xb2Sr	\xf0\xe3\xf5#\xfd\xb1\xed\xa3\x86\x8d\xf7\xdaP\xd1\xd6}\xbf\xa8ך-з\x97P3\xb3\x81ٌ\xea\xb0SG\x8e?\xa67m3\xdb\xc74l\x83\x9euu{f\x8b\xba\xe8\xad\xcd>o\x9c\xcfE\xdfs_\xbe\xccJ]+9\xe6\x82\xfel\xa8\xf6]\xd0N\xb9\xfc\xa4W4L\xa6\xd9\xc6\xe3\x9ef\xba\x9cijcC\x89\x9d#7\x94\xa7q\x96\xb7<\x9fo4A\xd5r5\xbbT`\xa7\xd8	-X`\xf3jV\xcdj\xb6\xe5\x94N\xaf\x85\xdc\xde\xc5\xd6/\xc7]\xbbn\xb5,\xb9z\xdbS\xe5\x9c\xe7>\xadǟ*{\x9ei\xd8\xf6\xd3\xff  \xff\xff0\xbaN\x97  
2024-12-02T20:33:04.358Z [DEBUG] provider: plugin process exited: path=.terraform/providers/registry.terraform.io/***/akash/0.1.1/linux_amd64/terraform-provider-akash_v0.1.1 pid=355
2024-12-02T20:33:04.358Z [DEBUG] provider: plugin exited

OpenTofu used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+   create

OpenTofu will perform the following actions:

  # module.etcd.module.etcd_deployment.akash_deployment.service will be created
+   resource "akash_deployment" "service" {
+       deployment_dseq               = (known after apply)
+       deployment_gseq               = (known after apply)
+       deployment_oseq               = (known after apply)
+       deployment_owner              = (known after apply)
+       deployment_state              = (known after apply)
+       escrow_account_balance_amount = (known after apply)
+       escrow_account_balance_denom  = (known after apply)
+       escrow_account_owner          = (known after apply)
+       id                            = (known after apply)
+       last_updated                  = (known after apply)
+       provider_address              = (known after apply)
+       sdl                           = (sensitive value)
+       services                      = (known after apply)

+       provider_filters {
+           enforce   = true
+           providers = []
        }
    }

Plan: 1 to add, 0 to change, 0 to destroy.

```


</details>


---

To apply all these changes, comment:

```
terrateam apply
```

---

<details>
  <summary><h3>Feedback?</h3></summary>

Questions? Comments? Give feedback by commenting `terrateam feedback <your msg>`.  Your message lands directly in our inbox.

</details>
